CSI API ETABS v1

# eSuperObjectClass Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eSuperObjectClass

    Public Enumeration eSuperObjectClass

    Dim instance As eSuperObjectClass

    public enum class eSuperObjectClass

    type eSuperObjectClass

Members

| Member name| Value| Description
---|---|---|---
| None| 0|
| SuperObject| 1|
| Foundation| 2|
| BridgeFoundation| 3|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com